Merge branch 'hafisc:main' into Equipment_lab
